app/views/users/show.html.erb

SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 100]]
---

      <h3>Posts:  <%= @user.microposts.count %> </h3>