app/views/shared/_user_info.html.erb


<span class="w3-badge w3-small w3-grey"><%= current_user.microposts.count %></span>
---
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 100]]