app/controllers/microposts_controller.rb

  def create
    @micropost = current_user.microposts.build(micropost_params)
    if @micropost.save
      flash[:success] = "Micropost created!"
      redirect_to root_url
    else
      p 'sadf'
      @feed_items = []
      @microposts = Micropost.all.paginate(page: params[:page])
---
INSERT INTO "microposts" ("content", "tag", "user_id", "created_at", "updated_at", "attachment") VALUES (?, ?, ?, ?, ?, ?)  [["content", "asdf"], ["tag", "dwg"], ["user_id", 100], ["created_at", "2018-03-09 06:54:04.232548"], ["updated_at", "2018-03-09 06:54:04.232548"], ["attachment", "9781786461766_Code.zip"]]
SELECT  "microposts".* FROM "microposts" ORDER BY "microposts"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]