app/controllers/static_pages_controller.rb

SELECT  "microposts".* FROM "microposts" WHERE (user_id = 100) ORDER BY "microposts"."created_at" DESC LIMIT ? OFFSET ?  [["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 100]]
SELECT  "users".* FROM "users" WHERE "users"."activated" = ? LIMIT ? OFFSET ?  [["activated", "t"], ["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users" WHERE "users"."activated" = ?  [["activated", "t"]]
---
  def home
    if logged_in?
      @micropost  = current_user.microposts.build
      @feed_items = current_user.feed.paginate(page: params[:page])

      @microposts = Micropost.all.paginate(page: params[:page])

       @users = User.where(activated: true).paginate(page: params[:page])